attacker/data/sio+filtering/spoofing/ab_results/ab_106.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.100.1 (be patient)...apr_pollset_poll: The timeout specified has expired (70007)
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.100.1 (be patient).....done


Server Software:        uvicorn
Server Hostname:        192.168.100.1
Server Port:            5000

Document Path:          /matmul
Document Length:        89 bytes

Concurrency Level:      10
Time taken for tests:   254.282 seconds
Complete requests:      20
Failed requests:        14
   (Connect: 0, Receive: 0, Length: 14, Exceptions: 0)
Non-2xx responses:      14
Keep-Alive requests:    6
Total transferred:      3892 bytes
HTML transferred:       1836 bytes
Requests per second:    0.08 [#/sec] (mean)
Time per request:       127141.171 [ms] (mean)
Time per request:       12714.117 [ms] (mean, across all concurrent requests)
Transfer rate:          0.01 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   72  99.1      3     213
Processing:  1944 88906 54612.8 120158  129996
Waiting:     1943 88906 54612.7 120158  129996
Total:       2157 88977 54592.3 120371  129996

Percentage of the requests served within a certain time (ms)
  50%  120371
  66%  126719
  75%  126721
  80%  126721
  90%  126721
  95%  129996
  98%  129996
  99%  129996
 100%  129996 (longest request)
