attacker/data/sio+filtering/spoofing/ab_results/ab_54.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.100.1 (be patient).....done


Server Software:        uvicorn
Server Hostname:        192.168.100.1
Server Port:            5000

Document Path:          /matmul
Document Length:        89 bytes

Concurrency Level:      10
Time taken for tests:   196.934 seconds
Complete requests:      20
Failed requests:        15
   (Connect: 0, Receive: 0, Length: 15, Exceptions: 0)
Non-2xx responses:      10
Keep-Alive requests:    10
Total transferred:      4042 bytes
HTML transferred:       1722 bytes
Requests per second:    0.10 [#/sec] (mean)
Time per request:       98467.118 [ms] (mean)
Time per request:       9846.712 [ms] (mean, across all concurrent requests)
Transfer rate:          0.02 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   96 102.1     10     206
Processing:  1728 68981 62610.6 120111  130257
Waiting:     1728 68981 62610.6 120110  130257
Total:       1738 69077 62702.4 120111  130463

Percentage of the requests served within a certain time (ms)
  50%  120111
  66%  130462
  75%  130462
  80%  130462
  90%  130463
  95%  130463
  98%  130463
  99%  130463
 100%  130463 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.100.1 (be patient)...apr_pollset_poll: The timeout specified has expired (70007)
Total of 1 requests completed
