attacker/data/sio+filtering/spoofing/ab_results/ab_64.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.100.1 (be patient)...apr_pollset_poll: The timeout specified has expired (70007)
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.100.1 (be patient).....done


Server Software:        uvicorn
Server Hostname:        192.168.100.1
Server Port:            5000

Document Path:          /matmul
Document Length:        89 bytes

Concurrency Level:      10
Time taken for tests:   254.295 seconds
Complete requests:      20
Failed requests:        17
   (Connect: 0, Receive: 0, Length: 17, Exceptions: 0)
Non-2xx responses:      17
Keep-Alive requests:    3
Total transferred:      3706 bytes
HTML transferred:       1848 bytes
Requests per second:    0.08 [#/sec] (mean)
Time per request:       127147.615 [ms] (mean)
Time per request:       12714.762 [ms] (mean, across all concurrent requests)
Transfer rate:          0.01 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   94 103.6      6     214
Processing:  1945 106300 42962.5 120169  130006
Waiting:     1945 106299 42962.4 120169  130006
Total:       2159 106394 42944.7 120382  130006

Percentage of the requests served within a certain time (ms)
  50%  120382
  66%  126730
  75%  126730
  80%  126731
  90%  126731
  95%  130006
  98%  130006
  99%  130006
 100%  130006 (longest request)
